<?php

namespace Redwine\Database\Seeders;

use Illuminate\Database\Seeder;
use Redwine\Models\Post;
use Illuminate\Support\Facades\Hash;

class PostsTableSeeder extends Seeder
{
    /**
     * Auto generated seed file.
     */
    public static function run()
    {
        $news = Post::firstOrNew(['title' => 'წითელი ღვინის უნიკალური სამკურნალო თვისებები']);
        $news->fill([
            'author_id'        => 1,
            'category_id'      => 1,
            'slug'             => 'წითელი-ღვინის-უნიკალური-სამკურნალო',
            'excerpt'             => '<p>ღვინის სპეციალისტებისა და მედიკოსების აზრით, წითელი ღვინო კარგია წყლულის დროს. მასში შემავალი მთრიმლავი ნივთიერებები ხელს უწყობს წყლულის სწრაფად შეხორცებას.</p>',
            'body'          => '<p>ღვინის სპეციალისტებისა და მედიკოსების აზრით, წითელი ღვინო კარგია წყლულის დროს. მასში შემავალი მთრიმლავი ნივთიერებები ხელს უწყობს წყლულის სწრაფად შეხორცებას. წითელი მშრალი ღვინის მოხმარებას შეუძლია სმენის დაკარგვის თავიდან აცილება. წითელი ღვინო იცავს კბილების ემალს, მასში შემავალი პროანტოციანიდების შემცვლელობის გამო, ბაქტერიები (მათ შორის, სტრეპტოკოკები) კბილებზე ვერ ჩერდებიან. ამიტომ წითელი ღვინის რეგულარულად მომხმარებლებს ნაკლებად ემართებათ კარიესი. წითელი ღვინის მცირე რაოდენობა ამცირებს თირკმელებში ქვების წარმოქმნის რისკს და გააჩნია ტკბილი დაგაზული სასმელების საწინააღმდეგო ეფექტი, რომლებიც იწვევს თირკმელებში ქვების დაგროვებას.</p><p><br></p><p>წითელი ღვინო ადუნებს და ამშვიდებს, გვეხმარება გადაღლასთან ბრძოლაში. წითელი ღვინით სწრაფად შეიძლება დაწეული ჰემოგლობინის, ასევე ძალების აღდგენა მძიმე ავადმყოფობის შემდეგ. წითელი ღვინის სამკურნალო დოზა უნდა შეადგენდეს არაუმეტეს 50 გრამს (3 სუფრის კოვზი). შეიძლება ერთად დალევა ან 3-ჯერ დღეში სუფრის კოვზით ჭამის დროს. დასუსტებული ორგანიზმის აღსადგენად სასარგებლოა გლინტვეინის მიღება, რომლის დამზადება შესაძლებელია შემდეგი რეცეპტურით: ქვაბში ათავსებენ ათ მიხაკს, დაფქვილ მუსკატის კაკალს და დარიჩინს (შეიძლება ხილის ნაჭრების დამატებაც) ასხამენ მინიმალური რაოდენობის წყალს და ხარშავენ ნელ ცეცხლზე ათი წუთის განმავლობაში. ნახარშს აყოვნებენ გაცივებამდე.</p><p><br></p><p>ერთ ბოთლ წითელ ტკბილ ღვინოს ათბობენ ქვაბში (არ ადუღებენ) და უმატებენ საკაზმს და ოთხ კოვზ თაფლს. სვამენ ბოკალებით ან ფაიფურის ფიალებით. უხდება ფხვიერი ნამცხვრები.</p>',
            'image'            => 'witeli_gvino.jpg',
            'seo_title'        => 'წითელი ღვინის უნიკალური სამკურნალო თვისებები',
            'meta_description' => 'ღვინის სპეციალისტებისა და მედიკოსების აზრით, წითელი ღვინო კარგია წყლულის დროს. მასში შემავალი მთრიმლავი ნივთიერებები ხელს უწყობს წყლულის სწრაფად შეხორცებას.',
            'meta_keywords'    => 'ღვინო,წითელი,წითელი ღვინო,ღვინის სპეციალისტები,სამკურნალო',
            'status'           => 1
        ])->save();
    }
}
